<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"a5c64cff93bcb6dba1feffdcd996d44a526c587040c7aaaa84a09d4bc3506615","plan_job_ref":"Job plan #15 at https://github.com/GSA/usnotify-ssb/actions/runs/4915872068","plan_hash":"9cc5683de7ba471ff6bf6aad4f8352ed8e0edce905bee5fa3becee83e892cc3f","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.broker_sms.cloudfoundry_app.ssb must be replaced
-/+ resource "cloudfoundry_app" "ssb" {
      ~ enable_ssh                      = true -> false
      + health_check_http_endpoint      = (known after apply)
      ~ health_check_invocation_timeout = 0 -> (known after apply)
      ~ health_check_timeout            = 0 -> (known after apply)
      ~ id                              = "************************************" -> (known after apply)
      ~ id_bg                           = "************************************" -> (known after apply)
        name                            = "ssb-sms"
      ~ ports                           = [
          - 8080,
        ] -> (known after apply)
      ~ source_code_hash                = "Azau63OizjMPWBKlG+JGVKz6I48LdURxiTCOOxPZBzA=" -> "I6Kpq+JzVlzxHC16zHAwQgB8YrcotCVUnYVyCN/TZf0="
      ~ stack                           = "cflinuxfs4" -> "793876df-45b2-43cc-adcd-ccf88fea63f5" # forces replacement
      ~ strategy                        = "blue-green" -> "rolling"
        # (11 unchanged attributes hidden)

      - routes {
          - port  = 8080 -> null
          - route = "d9610756-6abb-4b90-984d-494853939c08" -> null
        }
      + routes {
          + port  = (known after apply)
          + route = "d9610756-6abb-4b90-984d-494853939c08"
        }

      ~ service_binding {
          - params           = (sensitive value) -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.broker_smtp.cloudfoundry_app.ssb must be replaced
-/+ resource "cloudfoundry_app" "ssb" {
      ~ enable_ssh                      = true -> false
      + health_check_http_endpoint      = (known after apply)
      ~ health_check_invocation_timeout = 0 -> (known after apply)
      ~ health_check_timeout            = 0 -> (known after apply)
      ~ id                              = "************************************" -> (known after apply)
      ~ id_bg                           = "************************************" -> (known after apply)
        name                            = "ssb-smtp"
      ~ ports                           = [
          - 8080,
        ] -> (known after apply)
      ~ stack                           = "cflinuxfs4" -> "793876df-45b2-43cc-adcd-ccf88fea63f5" # forces replacement
      ~ strategy                        = "blue-green" -> "rolling"
        # (12 unchanged attributes hidden)

      - routes {
          - port  = 8080 -> null
          - route = "9ed64b91-c24b-4e4c-9c13-1d8a906ef811" -> null
        }
      + routes {
          + port  = (known after apply)
          + route = "9ed64b91-c24b-4e4c-9c13-1d8a906ef811"
        }

      ~ service_binding {
          - params           = (sensitive value) -> null
            # (1 unchanged attribute hidden)
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [plan #15](https://github.com/GSA/usnotify-ssb/actions/runs/4915872068)